<?php

return [
    "dateStart" => "2024-02-01",
    "dateEnd" => "2024-10-01",
    "timeEstimation" => 40 * 144000000,
    "modules" => [
        "Введение в Kotlin",
        "Работа с Android Studio",
        "Основы функционального программирования",
        "Разработка мобильных приложений на Kotlin",
        "Kotlin и интероперабельность с Java",
        "Работа с сетью и базами данных в Kotlin",
        "Разработка многоплатформенных приложений"
    ],
    "longDescription" => "Курс Kotlin погружает студентов в мир разработки мобильных и серверных приложений с использованием одного из самых популярных языков программирования для Android. Курс охватывает все от основ Kotlin до разработки полноценных мобильных приложений и взаимодействия с Java. Студенты также узнают о многоплатформенной разработке и работе с сетевыми запросами и базами данных."
];