<?php

return [
    "dateStart" => "2024-04-10",
    "dateEnd" => "2024-12-10",
    "timeEstimation" => 35 * 144000000,
    "modules" => [
        "Основы JavaScript",
        "Работа с HTML/CSS и DOM",
        "Асинхронное программирование в JavaScript",
        "Фреймворки и библиотеки JavaScript (React, Vue)",
        "Node.js и серверная разработка",
        "Работа с базами данных в JavaScript",
        "Современные инструменты и практики в JavaScript",
        "Проектная работа и портфолио"
    ],
    "longDescription" => "Курс JavaScript предназначен для обучения полноценной веб-разработки, от клиентских скриптов до серверной логики. Студенты узнают о взаимодействии JavaScript с HTML и CSS, изучат асинхронное программирование и познакомятся с популярными фреймворками. Также курс включает в себя разработку на стороне сервера с использованием Node.js и работы с базами данных."
];