<?php

return [
    "dateStart" => "2024-01-09",
    "dateEnd" => "2024-09-09",
    "timeEstimation" => 35 * 144000000,
    "modules" => [
        "Регистрация в мессенджере Discord",
        "Английский для программистов",
        "Основы Java",
        "Java Core",
        "Git — система контроля версий",
        "Многопоточное программирование"
    ],
    "longDescription" => "Курс Java представляет собой глубокое погружение в один из самых распространенных и универсальных языков программирования в мире. Студенты изучат основные концепции объектно-ориентированного программирования, структуры данных, многопоточность и другие ключевые аспекты, необходимые для разработки масштабируемых и надежных приложений. Через комбинацию лекций и практических занятий они углубят свое понимание языка и его возможностей. Курс также охватывает основы работы с платформой Java, включая использование различных инструментов и фреймворков. По завершении обучения студенты будут готовы к разработке высококачественных приложений на Java и успешной карьере в сфере разработки программного обеспечения."
];