<?php

return [
    "dateStart" => "2024-03-15",
    "dateEnd" => "2024-11-15",
    "timeEstimation" => 45 * 3600000,
    "modules" => [
        "Основы Swift",
        "Разработка интерфейса в Xcode",
        "Swift и Objective-C: работа вместе",
        "Разработка iOS приложений с Swift",
        "Работа с базами данных и хранение данных в iOS",
        "SwiftUI и его возможности",
        "Разработка сетевых приложений на Swift",
        "Оптимизация и тестирование iOS приложений"
    ],
    "longDescription" => "Курс Swift обучает разработке приложений для iOS и MacOS, начиная с основ языка программирования Swift и заканчивая разработкой современных приложений с использованием SwiftUI. Курс включает в себя важные аспекты работы с Xcode, интеграции Swift и Objective-C, а также методы тестирования и оптимизации приложений."
];
